import random

select_m = []
select_m = ['韓国料理','和食','中華','洋食','その他']
k_food = ['ビビンバ','チェユットッパ','キムチチゲ','テンジャンチゲ','冷麺','テジプルベッ','カルグクス','すいとん','プデチゲ','サバ煮',
          'ポッサム','へジャンク','スンデク']
j_food = ['お寿司','うどん','すき焼き','ざるそば','冷やしうどん','タイの煮込み','牛丼','かつ丼','おにぎり','ラーメン','親子丼']
c_food = ['ジャージャー麵','チャンポン','酢豚','麻婆豆腐','カンプンギ','ラジョギ','マーラー湯','マーラーシャングォー','ホイコーロー',
          'チャーハン','ヤンジャンピ']
w_food = ['オムレツ','オムライス','ステーキ','ハンバーガー','チキンカツレツ','ポークカツレツ','カルボナーラ','ビーフシチュー',
          'トマトパスタ','バーベキューリブ']
etc_food = ['スンデ','トッポギ','キンパ','ラーメン(韓国)','ベトナムフォー','ブンチャー','インドカレー','パッタイ',
            'シュバインハクセン','今日はダイエットしよう','コンビニ弁当']

ko = random.sample(k_food, 5)
ja = random.sample(j_food,5)
ch = random.sample(c_food,5)
we = random.sample(w_food,5)
etc = random.sample(etc_food,5)

name = []
menu = []
name = input('お名前を入力して下さい : ')

def RandLunch():
    while True:
        menu = input('メニューを選んで下さい\n''韓国料理,和食,中華,洋食,その他 : ')

        if '韓国料理' == menu:
            print('----------------------------------')
            print('|%s様にお勧めするメニューは...!!! |' % name)
            print('----------------------------------')
            print('******************************************************************\n'
                  , ko, 'です!\n******************************************************************')
            break

        elif '和食' == menu:
            print('%s様にお勧めするメニューは...!!!' % name)
            print('******************************************************************\n'
                  , ja, 'です!\n******************************************************************')
            break

        elif '中華' == menu:
            print('%s様にお勧めするメニューは...!!!' % name)
            print('******************************************************************\n'
                  , ch, 'です!\n******************************************************************')
            break

        elif '洋食' == menu:
            print('%s様にお勧めするメニューは...!!!' % name)
            print('******************************************************************\n'
                  ,we,'です!\n******************************************************************')
            break

        elif 'その他' == menu:
            print('%s様にお勧めするメニューは...!!!' % name)
            print('******************************************************************\n'
                  , etc, 'です!\n******************************************************************')
            break

        else:
            print('入力が間違っています。もう一度入力して下さい。')

def ReTry():
    while True:
        retry = input('******************************************************************\n'
              'やり直しますか？ はい/いいえ : ')
        if retry == "はい":
            RandLunch()

        elif retry == "いいえ":
            print("プログラムを終了します。")
            break

        else:
            print('入力が間違っています。もう一度入力して下さい。')



RandLunch()
ReTry()