########################################################################################################################
test_str = '이유덕,이재영,권종표,이재영,박민호,강상희,이재영,김지완,최승혁,이성연,박영서,박민호,전경헌,송정환,김재성,이유덕,전경헌'
test_list = test_str.split(",")
test_set = set()


########################################################################################################################
def findname(pi, pj):
    num_piname = 0
    for i in test_list:
        num_piname += i[0:pj].count(pi)
    return print('찾는 대상: {}, {}명'.format(pi, num_piname))


# 1. 김씨와 이씨는 각각 몇명인가요?
findname('김', 1)
findname('이', 1)

# 2. "이재영"이라는 이름이 몇 번 반복되나요?
findname('이재영', 3)

# 3. 중복을 제거한 이름들을 출력하세요.
for i in test_list:
    test_set.add(i)
print(test_set)

# 4. 중복을 제거한 이름들을 오름차순으로 정렬하여 출력하세요
print(sorted(list(test_set)))
